Repository: 7void/TripSentry
Catalog: lib/l10n/*.arb
Languages: bn, hi, ml, ta, te

# appTitle
source: Tourist Safety App
bn: পর্যটক সুরক্ষা অ্যাপ
hi: पर्यटक सुरक्षा ऐप
ml: ടൂറിസ്റ്റ് സുരക്ഷ ആപ്പ്
ta: சுற்றுலா பாதுகாப்பு செயலி
te: పర్యాటక భద్రత యాప్

# appNameShort
source: TripSentry
bn: ট্রিপসেন্ট্রি
hi: ट्रिपसेंट्री
ml: ട്രിപ്പ്‌സെൻട്രി
ta: ட்ரிப் சென்ட்ரி
te: ట్రిప్‌సెంట్రీ

# menuRefresh
source: Refresh
bn: রিফ্রেশ
hi: रीफ़्रेश
ml: റിഫ്രെഷ് ചെയ്യുക
ta: புதுப்பிக்க
te: రిఫ్రెష్

# menuClearData
source: Clear Data
bn: ডেটা মুছুন
hi: डेटा हटाएँ
ml: ഡാറ്റ മായ്ക്കുക
ta: தரவு அழிக்க
te: డేటా క్లియర్ చేయి

# menuLogout
source: Logout
bn: লগ আউট
hi: लॉग आउट
ml: ലോഗൗട്ട്
ta: வெளியேறு
te: లాగ్ అవుట్

# menuClearDataConfirmTitle
source: Clear Tourist Data
bn: পর্যটক ডেটা মুছুন
hi: पर्यटक डेटा साफ़ करें
ml: ടൂറിസ്റ്റ് ഡാറ്റ മായ്ക്കുക
ta: சுற்றுலா தரவை அழிக்கவும்
te: పర్యాటక డేటాను క్లియర్ చేయి

# menuClearDataConfirmBody
source: This will permanently delete your tourist data and all associated information. This action cannot be undone.
bn: এটি আপনার পর্যটক ডেটা এবং সংশ্লিষ্ট সব তথ্য স্থায়ীভাবে মুছে দেবে। এই কাজটি ফেরত নেওয়া যাবে না।
hi: यह आपके पर्यटक डेटा और सभी संबंधित जानकारी को स्थायी रूप से हटा देगा। इसे वापस नहीं किया जा सकता।
ml: ഇത് നിങ്ങളുടെ ടൂറിസ്റ്റ് ഡാറ്റയും ബന്ധപ്പെട്ട എല്ലാ വിവരങ്ങളും സ്ഥിരമായി മായ്ക്കും. ഈ പ്രവർത്തനം തിരസ്ക്കരിക്കാൻ കഴിയില്ല.
ta: இது உங்கள் சுற்றுலா தரவையும் தொடர்புடைய அனைத்து தகவல்களையும் நிரந்தரமாக அழித்துவிடும். இந்த செயலை வாபஸ் பெற முடியாது.
te: ఇది మీ పర్యాటక డేటాను మరియు సంబంధించిన అన్ని సమాచారాన్ని శాశ్వతంగా తొలగిస్తుంది. ఈ చర్యను తిరస్కరించలేరు.

source: Cancel
bn: বাতিল
hi: रद्द करें
ml: റദ്ദാക്കുക
ta: ரத்து
te: రద్దు

source: Delete
bn: মুছুন
hi: हटाएँ
ml: മായ്ക്കുക
ta: அழிக்க
te: తొలగించు

# permissionBannerNeedBg
source: Allow background location to enable continuous safety alerts.
bn: ধারাবাহিক নিরাপত্তা সতর্কতার জন্য ব্যাকগ্রাউন্ড লোকেশন অনুমতি দিন।
hi: लगातार सुरक्षा अलर्ट के लिए बैकग्राउंड लोकेशन की अनुमति दें।
ml: നിരന്തര സുരക്ഷാ അലർട്ടുകൾക്കായി ബാക്ക്ഗ്രൗണ്ട് ലൊക്കേഷൻ അനുവദിക്കുക.
ta: தொடர்ச்சியான பாதுகாப்பு எச்சரிக்கைகளுக்கு பின்னணி இடத்தை அனுமதிக்கவும்.
te: నిరంతర భద్రతా అలర్ట్స్ కోసం బ్యాక్‌గ్రౌండ్ లోకేషన్ అనుమతించండి.

# permissionBannerNeedFg
source: Allow location access to enable safety tracking and alerts.
bn: সুরক্ষা ট্র্যাকিং এবং সতর্কতা সক্ষম করতে লোকেশন অ্যাক্সেস অনুমতি দিন।
hi: सुरक्षा ट्रैकिंग और अलर्ट सक्षम करने के लिए लोकेशन एक्सेस की अनुमति दें।
ml: സുരക്ഷാ ട്രാക്കിംഗ്, അലർട്ടുകൾ എന്നിവ പ്രവർത്തനക്ഷമമാക്കാൻ ലൊക്കേഷൻ ആക്സസ് അനുവദിക്കുക.
ta: பாதுகாப்பு கண்காணிப்பு மற்றும் எச்சரிக்கைகளை இயக்க இடம் அணுகலை அனுமதிக்கவும்.
te: భద్రతా ట్రాకింగ్ మరియు అలర్ట్స్ కోసం లోకేషన్ యాక్సెస్‌ను అనుమతించండి.

# permissionEnableBg
source: Enable Background
bn: ব্যাকগ্রাউন্ড চালু করুন
hi: बैकग्राउंड सक्षम करें
ml: ബാക്ക്ഗ്രൗണ്ട് പ്രവർത്തനക്ഷമമാക്കുക
ta: பின்னணி இயக்கவும்
te: బ్యాక్‌గ్రౌండ్ ఆన్ చేయి

# permissionEnableFg
source: Enable Location
bn: লোকেশন চালু করুন
hi: लोकेशन सक्षम करें
ml: ലൊക്കേഷൻ പ്രവർത്തനക്ഷമമാക്കുക
ta: இடத்தை இயக்கவும்
te: లోకేషన్ ఆన్ చేయి

source: Settings
bn: সেটিংস
hi: सेटिंग्स
ml: ക്രമീകരണം
ta: அமைப்புகள்
te: సెట్టింగ్స్

# snackGrantLocationFirst
source: Grant location permission first.
bn: প্রথমে লোকেশন অনুমতি দিন।
hi: पहले लोकेशन अनुमति दें।
ml: ആദ്യം ലൊക്കേഷൻ അനുമതി നൽകുക.
ta: முதலில் இடம் அனுமதியை வழங்குங்கள்.
te: ముందుగా లోకేషన్ అనుమతిని ఇవ్వండి.

# snackEnableBackground
source: Enable "Allow all the time" for continuous safety tracking.
bn: ধারাবাহিক সুরক্ষা ট্র্যাকিংয়ের জন্য 'সবসময় অনুমতি দিন' চালু করুন।
hi: निरंतर सुरक्षा ट्रैकिंग के लिए 'हमेशा अनुमति दें' सक्षम करें।
ml: നിരന്തര സുരക്ഷാ ട്രാക്കിംഗിനായി 'എപ്പോഴും അനുവദിക്കുക' പ്രവർത്തനക്ഷമമാക്കുക.
ta: தொடர்ச்சியான பாதுகாப்பு கண்காணிப்புக்காக 'எப்போதும் அனுமதி' ஐ இயக்கவும்.
te: నిరంతర భద్రతా ట్రాకింగ్ కోసం 'ఎల్లప్పుడూ అనుమతించు' ను ప్రారంభించండి.

# snackBgNeeded
source: Background location needed for alerts.
bn: সতর্কতার জন্য ব্যাকগ্রাউন্ড লোকেশন প্রয়োজন।
hi: अलर्ट के लिए बैकग्राउंड लोकेशन आवश्यक है।
ml: അലർട്ടുകൾക്കായി ബാക്ക്ഗ്രൗണ്ട് ലൊക്കേഷൻ ആവശ്യമുണ്ട്.
ta: எச்சரிக்கைகளுக்கு பின்னணி இடம் தேவை.
te: అలర్ట్స్ కోసం బ్యాక్‌గ్రౌండ్ లోకేషన్ అవసరం.

# snackFeatureComingSoon
source: This feature is coming soon!
bn: ফিচারটি শীঘ্রই আসছে!
hi: यह सुविधा जल्द आ रही है!
ml: ഈ സവിശേഷത ഉടൻ വരുന്നു!
ta: இந்த அம்சம் விரைவில் வருகிறது!
te: ఈ ఫీచర్ త్వరలో వస్తుంది!

# snackNoMetadata
source: No metadata found for your Tourist ID.
bn: আপনার Tourist ID-এর জন্য কোনো মেটাডেটা পাওয়া যায়নি।
hi: आपके Tourist ID के लिए कोई मेटाडेटा नहीं मिला।
ml: നിങ്ങളുടെ Tourist ID-ന് ബന്ധപ്പെട്ട മെറ്റാഡേറ്റ ഒന്നും കണ്ടെത്താനായില്ല.
ta: உங்கள் Tourist ID க்கு எந்த மெட்டாடேட்டாவும் கிடைக்கவில்லை.
te: మీ Tourist ID కు ఎటువంటి మెటాడేటా కనుగొనబడలేదు.

source: Dismiss
bn: বন্ধ করুন
hi: खारिज करें
ml: പുറത്താക്കുക
ta: மூடு
te: డిస్మిస్

source: Error
bn: ত্রুটি
hi: त्रुटि
ml: പിശക്
ta: பிழை
te: లోపం

# trackingActive
source: Tracking Active (tap to pause)
bn: ট্র্যাকিং চলছে (স্থগিত করতে ট্যাপ করুন)
hi: ट्रैकिंग चालू (रोकने हेतु टैप करें)
ml: ട്രാക്കിംഗ് സജീവമാണ് (താൽക്കാലികമായി നിർത്താൻ ടാപ് ചെയ്യുക)
ta: கண்காணிப்பு செயலில் (இடைநிறுத்த தட்டவும்)
te: ట్రాకింగ్ యాక్టివ్ (పాజ్ చేయడానికి ట్యాప్ చేయండి)

# trackingPaused
source: Tracking Paused (tap to resume)
bn: ট্র্যাকিং বন্ধ (আবার শুরু করতে ট্যাপ করুন)
hi: ट्रैकिंग रुकी (दोबारा शुरू हेतु टैप करें)
ml: ട്രാക്കിംഗ് നിർത്തിയിരിക്കുന്നു (വീണ്ടും ആരംഭിക്കാൻ ടാപ് ചെയ്യുക)
ta: கண்காணிப்பு நிறுத்தப்பட்டுள்ளது (மீண்டும் தொடங்க தட்டவும்)
te: ట్రాకింగ్ నిలిపివేయబడింది (మళ్లీ ప్రారంభించడానికి ట్యాప్ చేయండి)

source: Tourist ID
bn: ট্যুরিস্ট আইডি
hi: टूरिस्ट आईडी
ml: ടൂറിസ്റ്റ് ഐഡി
ta: சுற்றுலா ஐடி
te: టూరిస్ట్ ఐడి

source: Token ID:
bn: টোকেন আইডি:
hi: टोकन आईडी:
ml: ടോക്കൺ ഐഡി:
ta: டோக்கன் ஐடி:
te: టోకెన్ ఐడి:

source: Valid Until:
bn: যতদিন বৈধ:
hi: मान्य तिथि:
ml: വലിഡ് അൺറ്റിൽ:
ta: செல்லுபடியாகும் நாள்:
te: చెల్లుబాటు వరకు:

source: Status:
bn: অবস্থা:
hi: स्थिति:
ml: സ്ഥിതി:
ta: நிலை:
te: స్థితి:

source: Active
bn: সক্রিয়
hi: सक्रिय
ml: സജീവം
ta: செயலில்
te: సక్రియం

source: Inactive
bn: নিষ্ক্রিয়
hi: निष्क्रिय
ml: നിഷ്ക്രിയം
ta: செயலிழந்தது
te: నిష్క్రియం

source: EXPIRED
bn: মেয়াদোত্তীর্ণ
hi: समाप्त
ml: കാലാവധി കഴിഞ്ഞു
ta: காலாவதியானது
te: గడువు ముగిసింది

# active_caps
source: ACTIVE
bn: সক্রিয়
hi: सक्रिय
ml: സജീവം
ta: செயலில்
te: సక్రియం

source: View ID
bn: আইডি দেখুন
hi: आईडी देखें
ml: ഐഡി കാണുക
ta: ஐடி பார்க்க
te: ఐడి చూడి

# noTouristIdBody
source: You don't have an active Tourist ID yet. Create one to enjoy a secure and verified travel experience.
bn: আপনার কোনো সক্রিয় Tourist ID নেই। নিরাপদ এবং যাচাইকৃত ভ্রমণের অভিজ্ঞতার জন্য একটি তৈরি করুন।
hi: आपके पास अभी कोई सक्रिय Tourist ID नहीं है। सुरक्षित और सत्यापित यात्रा अनुभव के लिए एक बनाएं।
ml: നിങ്ങൾക്ക് ഇപ്പോഴും സജീവമായ Tourist ID ഇല്ല. സുരക്ഷിതവും സ്ഥിരീകരിച്ചതുമായ യാത്രാ അനുഭവത്തിനായി ഒന്ന് സൃഷ്ടിക്കുക.
ta: உங்களுக்கு இன்னும் செயல்பாட்டில் உள்ள Tourist ID இல்லை. பாதுகாப்பான மற்றும் சரிபார்க்கப்பட்ட பயண அனுபவத்திற்காக ஒன்றை உருவாக்குங்கள்.
te: మీకు ఇంకా యాక్టివ్ Tourist ID లేదు. భద్రతాయుతమైన మరియు ధృవీకరించిన ప్రయాణ అనుభవం కోసం ఒకదాన్ని సృష్టించండి.

source: Create Tourist ID
bn: ট্যুরিস্ট আইডি তৈরি করুন
hi: टूरिस्ट आईडी बनाएं
ml: ടൂറിസ്റ്റ് ഐഡി സൃഷ്ടിക്കുക
ta: சுற்றுலா ஐடி உருவாக்கவும்
te: టూరిస్ట్ ఐడి సృష్టించండి

source: Quick Actions
bn: দ্রুত কার্যাবলী
hi: त्वरित क्रियाएँ
ml: പെട്ടെന്ന് ആക്ഷൻസ്
ta: விரைவு செயல்கள்
te: త్వరిత చర్యలు

source: QR Check-In
bn: কিউআর চেক-ইন
hi: क्यूआर चेक-इन
ml: QR ചെക്ക്-ഇൻ
ta: QR செக்-இன்
te: QR చెక్-ఇన్

source: Emergency
bn: জরুরি
hi: आपातकाल
ml: അടിയന്തരാവസ്ഥ
ta: அவசரம்
te: అత్యవసరం

source: Check-In
bn: চেক-ইন
hi: चेक-इन
ml: ചെക്ക്-ഇൻ
ta: செக்-இன்
te: చెక్-ఇన్

source: Geo Location
bn: জিও লোকেশন
hi: जियो लोकेशन
ml: ഭൗമസ്ഥാനം
ta: புவிஇடம்
te: భౌగోళిక స్థానం

# deleteExpiredTitle
source: Delete Expired Tourist ID
bn: মেয়াদোত্তীর্ণ ট্যুরিস্ট আইডি মুছুন
hi: समाप्त टूरिस्ट आईडी हटाएँ
ml: കാലാവധി കഴിഞ്ഞ ടൂറിസ്റ്റ് ഐഡി മായ്ക്കുക
ta: காலாவதியான சுற்றுலா ஐடி அழிக்க
te: గడువు ముగిసిన టూరిస్ట్ ఐడి తొలగించు

# deleteExpiredBody
source: This will permanently delete your expired Tourist ID from the blockchain. This action cannot be undone.
bn: এটি আপনার মেয়াদোত্তীর্ণ ট্যুরিস্ট আইডি ব্লকচেইন থেকে স্থায়ীভাবে মুছে দেবে। এটি ফেরত নেওয়া যাবে না।
hi: यह आपके समाप्त टूरिस्ट आईडी को ब्लॉकचेन से स्थायी रूप से हटा देगा। इसे वापस नहीं किया जा सकता।
ml: ഇത് നിങ്ങളുടെ കാലാവധി കഴിഞ്ഞ ടൂറിസ്റ്റ് ഐഡിയെ ബ്ലോക്ക്ചെയിനിൽ നിന്ന് സ്ഥിരമായി മായ്ക്കും. ഇത് തിരികെ കൊണ്ടുവരാൻ കഴിയില്ല.
ta: இது உங்கள் காலாவதியான சுற்றுலா ஐடியை ப்ளாக்செயினிலிருந்து நிரந்தரமாக அகற்றும். இதை மீட்டெடுக்க முடியாது.
te: ఇది మీ గడువు ముగిసిన టూరిస్ట్ ఐడిని బ్లాక్‌చెయిన్ నుండి శాశ్వతంగా తొలగిస్తుంది. దీన్ని తిరిగి పొందలేరు.

# deletedSuccessfully
source: Tourist ID deleted successfully
bn: ট্যুরিস্ট আইডি সফলভাবে মুছে ফেলা হয়েছে
hi: टूरिस्ट आईडी सफलतापूर्वक हटाई गई
ml: ടൂറിസ്റ്റ് ഐഡി വിജയകരമായി മായ്ച്ചു
ta: சுற்றுலா ஐடி வெற்றிகரமாக அகற்றப்பட்டது
te: టూరిస్ట్ ఐడి విజయవంతంగా తొలగించబడింది

# deleteFailed
source: Failed to delete Tourist ID
bn: ট্যুরিস্ট আইডি মুছতে ব্যর্থ
hi: टूरिस्ट आईडी हटाने में विफल
ml: ടൂറിസ്റ്റ് ഐഡി മായ്ക്കൽ പരാജയപ്പെട്ടു
ta: சுற்றுலா ஐடி அகற்றம் தோல்வியடைந்தது
te: టూరిస్ట్ ఐడి తొలగించడం విఫలమైంది

source: Listening…
bn: শুনছে…
hi: सुन रहा है…
ml: കേൾക്കുന്നു…
ta: கேட்கிறது…
te: వింటోంది…

# noEmergencyNumber
source: No emergency contact number found
bn: কোনো জরুরি যোগাযোগ নম্বর পাওয়া যায়নি
hi: कोई आपातकालीन संपर्क नंबर नहीं मिला
ml: അടിയന്തര ബന്ധപ്പെടാനുള്ള നമ്പർ കണ്ടെത്താനായില്ല
ta: அவசர தொடர்பு எண் எதுவும் கிடைக்கவில்லை
te: అత్యవసర సంప్రదింపు నంబర్ కనబడలేదు

# invalidEmergencyNumber
source: Invalid emergency contact number
bn: অবৈধ জরুরি যোগাযোগ নম্বর
hi: अमान्य आपातकालीन संपर्क नंबर
ml: അസാധുവായ അടിയന്തര ബന്ധപ്പെടാനുള്ള നമ്പർ
ta: தவறான அவசர தொடர்பு எண்
te: చెల్లని అత్యవసర సంప్రదింపు నంబర్

# unableToCall
source: Unable to initiate call on this device
bn: এই ডিভাইসে কল শুরু করা যাচ্ছে না
hi: इस डिवाइस पर कॉल शुरू नहीं की जा सकी
ml: ഈ ഉപകരണത്തിൽ കോൾ ആരംഭിക്കാൻ കഴിഞ്ഞില്ല
ta: இந்த சாதனத்தில் அழைப்பை தொடங்க முடியவில்லை
te: ఈ పరికరంలో కాల్ ప్రారంభించలేకపోయాము

# failedToStartCall
source: Failed to start call: {error}
bn: কল শুরু করতে ব্যর্থ: {error}
hi: कॉल शुरू करने में विफल: {error}
ml: കോൾ ആരംഭിക്കുന്നതിൽ പരാജയപ്പെട്ടു: {error}
ta: அழைப்பைத் தொடங்க இயலவில்லை: {error}
te: కాల్ ప్రారంభించడంలో విఫలమైంది: {error}

source: Language
bn: ভাষা
hi: भाषा
ml: ഭാഷ
ta: மொழி
te: భాష
